"""1. Создайте игру "Угадай число", в которой игрок должен угадать случайное
число в заданном диапазоне, делая ставки на каждое число. Если игрок угадывает число, он удваивает
ставку, если нет, он теряет ставку. Диапазон чисел, количество попыток для угадывания и начальный капитал
должны считываться из конфигурационного файла.
2. Программа должна быть разделена на несколько модулей.
3. Установите библиотеку python-decouple в виртуальную среду вашего проекта.
4. Создайте файл requirements.txt и зафиксируйте зависимости проекта с
помощью команды pip freeze.
5. Создайте файл settings.ini и укажите в нем диапазон чисел,
количество попыток и начальный капитал.
6. Создайте основной модуль для запуска игры (main.py).
7. Создайте модуль с логикой игры (logic.py)"""